; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_2 ?v4 ?v7)
             (pred_9 ?v6 ?v13)
             (pred_12 ?v4 ?v13)
             (pred_5 ?v9 ?v4 )
	     (pred_6 ?v4)
             (pred_4 ?v11)
             (pred_8 ?v6)
             (pred_11 ?v13)
             (pred_1 ?v4)
             (pred_10 ?v6)
             (pred_7 ?v4)
             (pred_3 ))



(:action op_1
:parameters (?v8 ?v2 ?v3 ?v12)
:precondition (and (pred_4 ?v8) (pred_4 ?v2) (pred_8 ?v3) (pred_11 ?v12)
          (pred_2 ?v8 ?v2) (pred_9 ?v3 ?v12)
                   (pred_12 ?v2 ?v12) (pred_6 ?v8) 
                   (pred_1 ?v2) (pred_10 ?v3))
:effect (and  (pred_7 ?v2) (not (pred_1 ?v2))))


(:action op_2
:parameters (?v8 ?v1)
:precondition (and (pred_4 ?v8) (pred_4 ?v1)
               (pred_6 ?v8) (pred_2 ?v8 ?v1) (pred_7 ?v1))
:effect (and (pred_6 ?v1) (not (pred_6 ?v8))))

(:action op_4
:parameters (?v8 ?v3)
:precondition (and (pred_4 ?v8) (pred_8 ?v3) 
                  (pred_6 ?v8) (pred_5 ?v3 ?v8) (pred_3 ))
:effect (and (pred_10 ?v3)
   (not (pred_5 ?v3 ?v8)) (not (pred_3 ))))


(:action op_5
:parameters (?v8 ?v10 ?v5)
:precondition (and (pred_4 ?v8) (pred_8 ?v10) (pred_8 ?v5)
                  (pred_6 ?v8) (pred_10 ?v5) (pred_5 ?v10 ?v8))
:effect (and (pred_10 ?v10) (pred_5 ?v5 ?v8)
        (not (pred_10 ?v5)) (not (pred_5 ?v10 ?v8))))

(:action op_3
:parameters (?v8 ?v3)
:precondition (and (pred_4 ?v8) (pred_8 ?v3) 
                  (pred_6 ?v8) (pred_10 ?v3))
:effect (and (pred_3 ) (pred_5 ?v3 ?v8) (not (pred_10 ?v3)))))

; problem
(define (problem grid-4-4-3-3-3)
    (:domain grid)
    (:objects
    obj_08 obj_07 obj_13 obj_19 obj_02 obj_04 obj_15 obj_21 obj_01 obj_22 obj_06 obj_12 obj_17 obj_03 obj_11 obj_20
    obj_16 obj_10 obj_09
    obj_14 obj_18 obj_05
    )

    (:init
       (pred_3)

       (pred_4 obj_08)
       (pred_4 obj_07)
       (pred_4 obj_13)
       (pred_4 obj_19)
       (pred_4 obj_02)
       (pred_4 obj_04)
       (pred_4 obj_15)
       (pred_4 obj_21)
       (pred_4 obj_01)
       (pred_4 obj_22)
       (pred_4 obj_06)
       (pred_4 obj_12)
       (pred_4 obj_17)
       (pred_4 obj_03)
       (pred_4 obj_11)
       (pred_4 obj_20)
       (pred_11 obj_16)
       (pred_11 obj_10)
       (pred_11 obj_09)
       (pred_8 obj_14)
       (pred_8 obj_18)
       (pred_8 obj_05)

       (pred_2 obj_08 obj_02)
       (pred_2 obj_08 obj_07)
       (pred_2 obj_07 obj_04)
       (pred_2 obj_07 obj_13)
       (pred_2 obj_07 obj_08)
       (pred_2 obj_13 obj_15)
       (pred_2 obj_13 obj_19)
       (pred_2 obj_13 obj_07)
       (pred_2 obj_19 obj_21)
       (pred_2 obj_19 obj_13)
       (pred_2 obj_02 obj_01)
       (pred_2 obj_02 obj_04)
       (pred_2 obj_02 obj_08)
       (pred_2 obj_04 obj_22)
       (pred_2 obj_04 obj_15)
       (pred_2 obj_04 obj_07)
       (pred_2 obj_04 obj_02)
       (pred_2 obj_15 obj_06)
       (pred_2 obj_15 obj_21)
       (pred_2 obj_15 obj_13)
       (pred_2 obj_15 obj_04)
       (pred_2 obj_21 obj_12)
       (pred_2 obj_21 obj_19)
       (pred_2 obj_21 obj_15)
       (pred_2 obj_01 obj_17)
       (pred_2 obj_01 obj_22)
       (pred_2 obj_01 obj_02)
       (pred_2 obj_22 obj_03)
       (pred_2 obj_22 obj_06)
       (pred_2 obj_22 obj_04)
       (pred_2 obj_22 obj_01)
       (pred_2 obj_06 obj_11)
       (pred_2 obj_06 obj_12)
       (pred_2 obj_06 obj_15)
       (pred_2 obj_06 obj_22)
       (pred_2 obj_12 obj_20)
       (pred_2 obj_12 obj_21)
       (pred_2 obj_12 obj_06)
       (pred_2 obj_17 obj_03)
       (pred_2 obj_17 obj_01)
       (pred_2 obj_03 obj_11)
       (pred_2 obj_03 obj_22)
       (pred_2 obj_03 obj_17)
       (pred_2 obj_11 obj_20)
       (pred_2 obj_11 obj_06)
       (pred_2 obj_11 obj_03)
       (pred_2 obj_20 obj_12)
       (pred_2 obj_20 obj_11)
       (pred_1 obj_01)
       (pred_1 obj_21)
       (pred_1 obj_20)
       (pred_12  obj_01 obj_16)
       (pred_12  obj_21 obj_10)
       (pred_12  obj_20 obj_09)
       (pred_7 obj_08)
       (pred_7 obj_07)
       (pred_7 obj_13)
       (pred_7 obj_19)
       (pred_7 obj_02)
       (pred_7 obj_04)
       (pred_7 obj_15)
       (pred_7 obj_22)
       (pred_7 obj_06)
       (pred_7 obj_12)
       (pred_7 obj_17)
       (pred_7 obj_03)
       (pred_7 obj_11)

       (pred_9  obj_14 obj_16)
       (pred_9  obj_18 obj_10)
       (pred_9  obj_05 obj_09)
       (pred_5 obj_14 obj_03)
       (pred_5 obj_18 obj_13)
       (pred_5 obj_05 obj_22)
       (pred_6 obj_06)
    )

    (:goal (and
       (pred_5 obj_14 obj_01)
       (pred_5 obj_18 obj_11)
       (pred_5 obj_05 obj_07)
    ))
(:constraints
  (always (not (pred_6 obj_15)))
)
)

; plan
1. (op_2 obj_06 obj_11)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_11)
   goals met: 0 of 3
2. (op_2 obj_11 obj_03)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_03)
   goals met: 0 of 3
3. (op_4 obj_03 obj_14)
   deleted: (pred_5 obj_14 obj_03) (pred_3)
   added: (pred_10 obj_14)
   goals met: 0 of 3
4. (op_2 obj_03 obj_11)
   deleted: (pred_6 obj_03)
   added: (pred_6 obj_11)
   goals met: 0 of 3
5. (op_2 obj_11 obj_06)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_06)
   goals met: 0 of 3
6. (op_2 obj_06 obj_22)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_22)
   goals met: 0 of 3
7. (op_1 obj_22 obj_01 obj_14 obj_16)
   deleted: (pred_1 obj_01)
   added: (pred_7 obj_01)
   goals met: 0 of 3
8. (op_2 obj_22 obj_06)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_06)
   goals met: 0 of 3
9. (op_2 obj_06 obj_11)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_11)
   goals met: 0 of 3
10. (op_3 obj_11 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_3) (pred_5 obj_14 obj_11)
   goals met: 0 of 3
11. (op_2 obj_11 obj_06)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_06)
   goals met: 0 of 3
12. (op_2 obj_06 obj_22)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_22)
   goals met: 0 of 3
13. (op_4 obj_22 obj_05)
   deleted: (pred_5 obj_05 obj_22) (pred_3)
   added: (pred_10 obj_05)
   goals met: 0 of 3
14. (op_2 obj_22 obj_04)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_04)
   goals met: 0 of 3
15. (op_2 obj_04 obj_07)
   deleted: (pred_6 obj_04)
   added: (pred_6 obj_07)
   goals met: 0 of 3
16. (op_3 obj_07 obj_05)
   deleted: (pred_10 obj_05)
   added: (pred_3) (pred_5 obj_05 obj_07)
   goals met: 1 of 3
17. (op_2 obj_07 obj_13)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_13)
   goals met: 1 of 3
18. (op_4 obj_13 obj_18)
   deleted: (pred_5 obj_18 obj_13) (pred_3)
   added: (pred_10 obj_18)
   goals met: 1 of 3
19. (op_2 obj_13 obj_07)
   deleted: (pred_6 obj_13)
   added: (pred_6 obj_07)
   goals met: 1 of 3
20. (op_2 obj_07 obj_08)
   deleted: (pred_6 obj_07)
   added: (pred_6 obj_08)
   goals met: 1 of 3
21. (op_2 obj_08 obj_02)
   deleted: (pred_6 obj_08)
   added: (pred_6 obj_02)
   goals met: 1 of 3
22. (op_2 obj_02 obj_01)
   deleted: (pred_6 obj_02)
   added: (pred_6 obj_01)
   goals met: 1 of 3
23. (op_2 obj_01 obj_22)
   deleted: (pred_6 obj_01)
   added: (pred_6 obj_22)
   goals met: 1 of 3
24. (op_2 obj_22 obj_06)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_06)
   goals met: 1 of 3
25. (op_2 obj_06 obj_11)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_11)
   goals met: 1 of 3
26. (op_5 obj_11 obj_14 obj_18)
   deleted: (pred_10 obj_18) (pred_5 obj_14 obj_11)
   added: (pred_10 obj_14) (pred_5 obj_18 obj_11)
   goals met: 2 of 3
27. (op_2 obj_11 obj_06)
   deleted: (pred_6 obj_11)
   added: (pred_6 obj_06)
   goals met: 2 of 3
28. (op_2 obj_06 obj_22)
   deleted: (pred_6 obj_06)
   added: (pred_6 obj_22)
   goals met: 2 of 3
29. (op_2 obj_22 obj_01)
   deleted: (pred_6 obj_22)
   added: (pred_6 obj_01)
   goals met: 2 of 3
30. (op_3 obj_01 obj_14)
   deleted: (pred_10 obj_14)
   added: (pred_3) (pred_5 obj_14 obj_01)
   goals met: 3 of 3
